Data = {
    hash: {},
    xtype: {
        0: { name: '货', uname: '货主', color: 'red' },
        1: { name: '车', uname: '车主', color: 'green' },
        2: { name: '船', uname: '船东', color: 'blue' }
    },
    insureStatus: {
        0: { name: '待投保', color: 'red' },
        1: { name: '待支付', color: '#06c' },
        2: { name: '投保中', color: '#f60' },
        3: { name: '已投保', color: 'green' },
        4: { name: '已退保', color: 'gray' }
    },
    tstatus: { 0: '在途', 1: '急走', 2: '待货' },
    tlong: '4.2米,4.5米,6.2米,6.8米,7.2米,8.2米,8.6米,9.6米,11.7米,12.5米,13米,13.5米,14米,17米,17.5米,18米',
    ttype: '平板,高栏,厢式,高低板,保温,冷藏,危险品',
    cargo: '普货,重货,泡货,设备,配件,百货,建材,食品,饮料,化工,农药,水果,蔬菜,木材,煤炭,石材,瓷砖',
    unit: '吨,方,件,车,个,太,箱',
    region: '东北:黑龙江:辽宁:吉林,华北:北京:天津:河北:内蒙古:山西,华东:上海:安徽:福建:山东:江苏:浙江,华南:广东:广西:海南,华中:河南:湖北:湖南:江西,西南:重庆:贵州:四川:西藏:云南,西北:甘肃:宁夏:青海:陕西:新疆',
    city: ""
    + "辽宁,丹东,大连,营口,锦州,葫芦岛|"
    + "河北,秦皇岛,京唐,曹妃甸,黄骅|"
    + "天津,天津|"
    + "山东,龙口,蓬莱,莱州,烟台,威海,石岛,青岛,日照,岚山,东营,潍坊|"
    + "江苏,连云港,大丰,南通,太仓,常熟,张家港,江阴,常州,泰州,镇江,扬州,南京|"
    + "安徽,芜湖,铜陵,马鞍山|"
    + "上海,上海|"
    + "浙江,台州,宁波,舟山,温州,乍浦,嘉兴|"
    + "福建,宁德,福州,湄洲湾,泉州,厦门,漳州,东山岛|"
    + "广东,汕头,深圳,广州,南沙,珠海,湛江,汕尾,阳江,茂名,中山,海安|"
    + "香港,香港|"
    + "澳门,澳门|"
    + "海南,海口,三亚,八所,洋浦|"
    + "广西,北海,钦州,防城港"
    //+ "辽宁,营口:鲅鱼圈:盖州:大石桥,大连:庄河:瓦房店:普兰店:长海:大连:葫芦岛,阜新:彰武:阜新县,丹东:凤城:东港:宽甸,鞍山:海城:台安:岫岩,辽阳:灯塔:辽阳县,朝阳:凌源:北票:朝阳县:建平:喀喇沁左翼,铁岭:调兵山:开原:铁岭县:昌图:西丰,本溪:本溪满族自治县:本溪:桓仁满族自治县,沈阳:法库:新民:沈阳:辽中:康平,锦州:凌海:锦州:黑山:义县:北镇,葫芦岛:兴城:绥中:建昌:葫芦岛,盘锦:盘山:大洼,抚顺:抚顺县:清原:新宾|"
    //+ "吉林,延边:图们:延吉:龙井:敦化:珲春:和龙:安图:汪清,白城:大安:洮南:镇赉:通榆,通化:梅河口:集安:通化县:辉南:柳河,吉林:蛟河:桦甸:舒兰:磐石:永吉,四平:公主岭:双辽:梨树:伊通,辽源:东辽:东丰,白山:临江:靖宇:抚松:长白,松原:乾安:长岭:扶余:前郭尔罗斯,长春:德惠:九台:榆树:农安|"
    //+ "黑龙江,大庆:肇源:林甸:肇州:杜尔伯特,哈尔滨:尚志:五常:双城:方正:宾县:依兰:巴彦:通河:木兰:延寿,佳木斯:同江:富锦:抚远:桦南:汤原:桦川,伊春:铁力:嘉荫,大兴安岭:呼玛:塔河:漠河:大兴安岭,黑河:北安:五大连池:逊克:嫩江:孙吴,绥化:安达:肇东:海伦:绥棱:明水:兰西:青冈:庆安:望奎,齐齐哈尔:讷河:富裕:拜泉:甘南:依安:克山:泰来:克东:龙江,鹤岗:萝北:绥滨,牡丹江:东宁:绥芬河:宁安:海林:穆棱:林口,七台河:勃利,双鸭山:宝清:集贤:友谊:饶河,鸡西:密山:鸡西:虎林:鸡东|"
    //+ "北京,北京:东城:西城:崇文:宣武:朝阳:丰台:石景山:海淀:门头沟:房山:通州:顺义:昌平:大兴:平谷:怀柔:密云:延庆|"
    //+ "天津,天津:宝坻:静海:宁河:大港:汉沽:塘沽:红挢:武清:河北:北辰:和平:东丽:河东:西青:河西:津南:南开:蓟县|"
    //+ "河北,保定:安国:涿州:定州:望都:满城:清苑:涞水:阜平:徐水:定兴:唐县:高阳:容城:涞源:安新:易县:曲阳:蠡县:顺平:博野:雄县:高碑店,沧州:吴桥:沧县:青县:献县:东光:海兴:盐山:肃宁:南皮:孟村:泊头:任丘:河间:黄骅,承德:承德县:兴隆:隆化:平泉:滦平:丰宁:围场:宽城,邯郸:武安:邯郸县:永年:曲周:馆陶:魏县:成安:大名:涉县:鸡泽:邱县:广平:肥乡:临漳:磁县,廊坊:霸州:固安:永清:香河:大城:文安:大厂:三河,秦皇岛:昌黎:卢龙:抚宁:青龙:南戴河:北戴河,唐山:迁西:滦南:玉田:唐海:乐亭:滦县:遵化:迁安,邢台:邢台县:隆尧:柏乡:清河:宁晋:任县:临城:广宗:临西:平乡:内丘:巨鹿:新河:南和:威县:南宫:沙河,张家口:宣化:康保:张北:阳原:赤城:沽源:怀安:怀来:崇礼:尚义:蔚县:涿鹿:万全,石家庄:辛集:平山:井陉:栾城:正定:灵寿:高邑:赵县:赞皇:深泽:无极:元氏:行唐:藁城:晋州:新乐:鹿泉,衡水:深州:冀州:饶阳:故城:阜城:安平:武邑:景县:武强:枣强|"
    //+ "内蒙古,锡林郭勒:二连浩特:锡林浩特:多伦:阿巴嘎:西乌珠穆沁:东乌珠穆沁:苏尼特左:苏尼特右:太仆寺:正镶白:正蓝:镶黄,乌兰察布:丰镇:兴和:卓资:商都:凉城:化德:察哈尔右翼前:察哈尔右翼后:察哈尔右翼中:四子王:集宁,兴安:乌兰浩特:阿尔山:突泉:扎赉特:科尔沁右翼前:科尔沁右翼中,乌海,呼伦贝尔:满洲里:牙克石:扎兰屯:根河:额尔古纳:陈巴尔虎:阿荣:新巴尔虎左:新巴尔虎右:鄂伦春:莫力达瓦:海拉尔:鄂温克,赤峰:巴林右:赤峰:宁城:林西:喀喇沁:巴林左:敖汉:阿鲁科尔沁:翁牛特:克什克腾,阿拉善:阿拉善左:阿拉善右:额济纳,鄂尔多斯:乌审:准格尔:伊金霍洛:鄂托克:鄂托克前:杭锦:达拉特,包头:固阳:土默特右:达尔罕茂明安,巴彦淖尔:五原:磴口:杭锦后:乌拉特中:乌拉特前:乌拉特后:临河,呼和浩特:托克托:清水河:武川:和林格:土默特左,通辽:霍林郭勒:开鲁:科尔沁左翼中:科尔沁左翼后:库伦:扎鲁特:奈曼|"
    //+ "山西,吕梁:孝义:汾阳:文水:中阳:兴县:临县:方山:柳林:岚县:交口:交城:石楼:离石,太原:阳曲:太原:古交:娄烦:清徐,临汾:候马:霍州:大宁:汾西:吉县:安泽:浮山:古县:隰县:襄汾:翼城:永和:乡宁:曲沃:洪洞:蒲县,阳泉:平定:盂县,晋城:高平:泽州:陵川:阳城:沁水,朔州:山阴:右玉:应县:怀仁,忻州:繁峙:忻州:原平:静乐:代县:神池:五寨:五台:偏关:宁武:河曲:保德:定襄:岢岚,大同:大同县:天镇:灵丘:阳高:左云:广灵:浑源,长治:潞城:长子:平顺:襄垣:沁源:屯留:黎城:武乡:沁县:壶关,晋中:介休:晋中:和顺:昔阳:灵石:祁县:左权:寿阳:太谷:平遥:榆社:榆次,运城:河津:永济:闻喜:新绛:平陆:垣曲:绛县:稷山:芮城:夏县:万荣:临猗|"
    //+ "上海,上海:宝山:闵行:奉贤:南汇:青浦:松江:金山:浦东:嘉定:杨浦:虹口:闸北:崇明:黄浦:卢湾:徐汇:长宁:静安:普陀:朱家角|"
    //+ "安徽,合肥:长丰:肥东:肥西:巢湖:庐江,芜湖:芜湖县:南陵:繁昌:无为,淮南:凤台,池州:东至:石台:青阳:贵池:九华山,六安:寿县:霍山:霍邱:舒城:金寨,马鞍山:当涂:含山:和县,滁州:天长:明光:全椒:来安:定远:凤阳,毫州:亳州:利辛:涡阳:蒙城,淮北:濉溪,安庆:桐城:宿松:枞阳:太湖:怀宁:岳西:望江:潜山,阜阳:界首:临泉:颍上:阜南:太和,铜陵:铜陵县,宣城:宁国:广德:郎溪:泾县:旌德:绩溪,黄山:歙县:休宁:祁门:黟县:屯溪,宿州:灵璧:萧县:泗县:砀山,蚌埠:怀远:固镇:五河|"
    //+ "福建,泉州:南安:泉州:石狮:晋江:惠安:永春:安溪:德化:金门,三明:永安:将乐:明溪:大田:宁化:建宁:沙县:尤溪:清流:泰宁,福州:长乐:闽侯:福清:闽清:永泰:连江:罗源:平潭,厦门,莆田:仙游,南平:建瓯:邵武:武夷山:建阳:松溪:光泽:顺昌:浦城:政和,漳州:龙海:漳州:平和:南靖:诏安:漳浦:华安:东山:长泰:云霄,龙岩:漳平:长汀:武平:上杭:永定:连城,宁德:福安:福鼎:寿宁:霞浦:柘荣:屏南:古田:周宁|"
    //+ "山东,济南:章丘:平阴:济阳:商河,菏泽:鄄城:单县:郓城:曹县:定陶:巨野:东明:成武,德州:乐陵:禹城:陵县:宁津:武城:庆云:平原:夏津:临邑,青岛:胶南:胶州:平度:莱西:即墨,临沂:沂水:苍山:平邑:莒南:蒙阴:临沭:费县:沂南:郯城,东营:垦利:广饶:利津,莱芜,枣庄:滕州,烟台:龙口:莱阳:莱州:招远:蓬莱:栖霞:海阳:长岛,聊城:临清:高唐:阳谷:茌平:莘县:东阿:冠县,淄博:桓台:高青:沂源,威海:乳山:文登:荣成,日照:五莲:莒县,泰安:新泰:肥城:宁阳:东平,济宁:曲阜:兖州:邹城:鱼台:金乡:嘉祥:微山:汶上:泗水:梁山,滨州:邹平:沾化:惠民:博兴:阳信:无棣,潍坊:青州:诸城:寿光:安丘:高密:昌邑:昌乐:临朐|"
    //+ "江苏,苏州:常熟:吴江:昆山:张家港:太仓,镇江:丹阳:扬中:句容,无锡:江阴:宜兴,徐州:新沂:邳州:铜山:睢宁:沛县:丰县,盐城:东台:大丰:响水:建湖:阜宁:射阳:滨海,淮安:涟水:洪泽:金湖:盱眙,宿迁:沭阳:泗阳:泗洪,扬州:高邮:江都:仪征:宝应,南通:如皋:启东:通州:海门:海安:如东,南京:溧水:高淳,连云港:东海:灌云:灌南:赣榆,泰州:泰兴:姜堰:靖江:兴化,常州:金坛:溧阳|"
    //+ "浙江,杭州:建德:桐庐:淳安:富阳:临安,湖州:德清:长兴:安吉,舟山:岱山:嵊泗,衢州:江山:常山:开化:龙游,绍兴:诸暨:上虞:嵊州:新昌:绍兴县,嘉兴:平湖:海宁:桐乡:嘉善:海盐,金华:武义:浦江:兰溪:义乌:东阳:永康:磐安,丽水:龙泉:青田:缙云:遂昌:松阳:云和:庆元:景宁畲族,温州:瑞安:乐清:洞头:永嘉:平阳:苍南:文成:泰顺,台州:临海:温岭:三门:玉环:天台:仙居:台州,宁波:慈溪:余姚:象山:宁海:奉化|"
    //+ "广东,中山,江门:开平:台山:江门:恩平:鹤山:新会,梅州:兴宁:梅县:蕉岭:大埔:丰顺:五华:平远,汕尾:海丰:陆丰:陆河,深圳:宝安:龙岗:深圳,佛山:顺德:佛山:南海:三水:高明,东莞,云浮:罗定:云安:新兴:郁南,惠州:惠东:博罗:龙门,河源:连平:和平:龙川:紫金:东源,湛江:廉江:雷州:遂溪:吴川:徐闻,揭阳:普宁:揭东:揭西:惠来,潮州:潮安:饶平,肇庆:高要:四会:广宁:德庆:封开:怀集,韶关:乐昌:南雄:仁化:始兴:翁源:新丰:乳源,清远:英德:连州:佛冈:阳山:连南:清新:连山,珠海,广州:从化:增城:花都:番禺,汕头:南澳:潮阳:澄海,阳江:阳春:阳江:阳东:阳西,茂名:高州:化州:信宜:电白|"
    //+ "广西,南宁:武鸣:隆安:马山:上林:宾阳:横县,梧州:岑溪:藤县:苍梧:蒙山,玉林:北流:容县:陆川:博白:兴业,贺州:钟山:昭平:富川,河池:宜州:河池:天峨:凤山:南丹:东兰:都安:罗城:巴马:环江:大化,百色:凌云:平果:西林:乐业:德保:田林:田阳:靖西:田东:那坡:隆林,柳州:柳江:柳城:鹿寨:三江:融安:融水,来宾:合山:象州:武宣:忻城:金秀,崇左:宁明:崇左:凭祥:扶绥:大新:天等:龙州,北海:合浦,防城港:东兴:上思,钦州:浦北:灵山,桂林:阳朔:临桂:灵川:全州:平乐:兴安:灌阳:荔浦:资源:永福:龙胜:恭城,贵港:桂平:贵港:平南|"
    //+ "海南,海口,三亚,五指山,琼海,儋州,文昌,中沙群岛,定安,屯昌,澄迈,临高,白沙,昌江,乐东,陵水,保亭,琼中,西沙群岛,南沙群岛,万宁,东方|"
    //+ "河南,信阳:商城:淮滨:息县:新县:固始:罗山:光山:潢川,洛阳:偃师:孟津:汝阳:伊川:洛宁:嵩县:宜阳:新安:栾川,三门峡:义马:灵宝:渑池:卢氏:陕县,商丘:永城:宁陵:虞城:民权:夏邑:柘城:睢县,许昌:禹州:长葛:许昌县:鄢陵:襄城:魏都,南阳:邓州:桐柏:方城:淅川:镇平:唐河:南召:内乡:新野:社旗:西峡,郑州:新郑:郑州:巩义:新密:登封:荥阳:中牟,鹤壁:浚县:淇县,开封:开封县:尉氏:兰考:杞县:通许,濮阳:南乐:濮阳县:台前:清丰:范县,安阳:林州:安阳县:滑县:内黄:汤阴,新乡:卫辉:辉县:封丘:新乡县:获嘉:原阳:长垣:延津,漯河:临颍:舞阳,周口:沈丘:项城:商水:淮阳:太康:鹿邑:西华:扶沟:郸城,驻马店:确山:新蔡:西平:泌阳:平舆:汝南:遂平:正阳,济源,平顶山:汝州:舞钢:宝丰:叶县:郏县:鲁山,焦作:沁阳:孟州:修武:温县:武陟:博爱|"
    //+ "湖北,宜昌:宜都:当阳:枝江:秭归:远安:兴山:五峰:长阳,襄阳:老河口:枣阳:宜城:谷城:保康:南漳,武汉,恩施,孝感:应城:安陆:汉川:云梦:大悟:孝昌,黄石:大冶:阳新:黄石,潜江,荆州:洪湖:石首:松滋:监利:公安:江陵,咸宁:赤壁:嘉鱼:通山:崇阳:通城,仙桃,随州:广水:随县,十堰:丹江口:郧县:竹山:房县:郧西:竹溪,神农架,荆门:钟祥:京山:沙洋,鄂州,黄冈:武穴:麻城:红安:罗田:浠水:蕲春:黄梅:英山:团风,天门|"
    //+ "湖南,长沙:长沙县:宁乡:望城:浏阳,怀化:洪江:会同:沅陵:辰溪:溆浦:中方:新晃:芷江:通道:靖州:麻阳,益阳:沅江:桃江:南县:安化,株洲:醴陵:株洲县:炎陵:茶陵:攸县,湘潭:湘乡:韶山:湘潭县,衡阳:耒阳:衡阳:常宁:衡阳县:衡东:衡山:衡南:祁东,邵阳:武冈:邵东:洞口:新邵:绥宁:新宁:邵阳县:隆回:城步,常德:津市:澧县:临澧:桃源:汉寿:石门:安乡,张家界:慈利:桑植,岳阳:汨罗:临湘:岳阳县:湘阴:平江:华容,郴州:资兴:宜章:汝城:安仁:嘉禾:临武:桂东:永兴:桂阳,永州:祁阳:蓝山:宁远:新田:东安:江永:道县:双牌:江华,娄底:冷水江:涟源:新化:双峰,湘西:吉首:古丈:龙山:永顺:凤凰:泸溪:保靖:花垣:湘西|"
    //+ "江西,上饶:德兴:上饶县:广丰:鄱阳:婺源:铅山:余干:横峰:弋阳:玉山:万年,景德镇:乐平:浮梁,宜春:樟树:丰城:高安:铜鼓:靖安:宜丰:奉新:万载:上高:宜春,吉安:井冈山:吉安县:永丰:永新:新干:泰和:峡江:遂川:安福:吉水:万安,抚州:南丰:乐安:南城:东乡:资溪:宜黄:广昌:黎川:崇仁:金溪,鹰潭:贵溪:余江,九江:瑞昌:九江县:星子:武宁:彭泽:永修:修水:湖口:德安:都昌,赣州:瑞金:南康:石城:安远:赣县:宁都:寻乌:兴国:定南:上犹:于都:龙南:崇义:信丰:全南:大余:会昌,南昌:新建:南昌县:进贤:安义,萍乡:莲花:上栗:芦溪,新余:分宜|"
    //+ "重庆,重庆:奉节:万州:涪陵:渝中:大渡口:江北:沙坪坝:九龙坡:南岸:北碚:万盛:双挢:渝北:巴南:黔江:长寿:綦江:潼南:铜梁:大足:荣昌:璧山:梁平:丰都:垫江:武隆:忠县:城口:开县:云阳:巫山:巫溪:石柱:秀山:酉阳:彭水:江津:合川:永川:南川|"
    //+ "贵州,遵义:仁怀:赤水:遵义县:绥阳:桐梓:习水:凤冈:正安:余庆:湄潭:道真:务川,安顺:普定:平坝:镇宁:紫云:关岭,毕节:黔西:毕节:大方:织金:金沙:赫章:纳雍:威宁,铜仁:德江:江口:思南:石阡:玉屏:松桃:印江:沿河:万山,贵阳:清镇:贵阳:开阳:修文:息烽,六盘水:水城:盘县:六枝,黔东南苗族侗族自治州:丹寨:施秉:从江:锦屏:镇远:麻江:台江:天柱:黄平:榕江:剑河:三穗:雷山:黎平:岑巩:凯里,黔西南布依族苗族自治州:兴义:望谟:兴仁:普安:册亨:晴隆:贞丰:安龙,黔南布依族苗族自治州:都匀:福泉:贵定:惠水:罗甸:瓮安:荔波:龙里:平塘:长顺:三都:独山|"
    //+ "四川,绵阳:江油:三台:盐亭:安县:梓潼:北川:平武:绵阳,内江:威远:资中:隆昌,巴中:南江:平昌:通江,甘孜:康定:丹巴:炉霍:九龙:甘孜县:雅江:新龙:道孚:白玉:理塘:德格:乡城:石渠:稻城:色达:巴塘:泸定:得荣,资阳:简阳:安岳:乐至,遂宁:蓬溪:射洪:大英,南充:阆中:南部:营山:蓬安:仪陇:西充,德阳:广汉:什邡:绵竹:中江:罗江,宜宾:宜宾县:南溪:江安:长宁:高县:珙县:筠连:兴文:屏山,泸州:泸县:泸州:合江:叙永:古蔺,广安:华蓥:广安:岳池:邻水:武胜,攀枝花:米易:盐边,成都:金堂:双流:郫县:大邑:蒲江:新津:都江堰:彭州:邛崃:崇州,乐山:峨眉山:犍为:井研:夹江:沐川:峨边:马边,眉山:仁寿:彭山:洪雅:丹棱:青神,自贡:荣县:富顺,达州:万源:达县:渠县:宣汉:开江:大竹,雅安:芦山:石棉:名山:天全:荥经:宝兴:汉源,凉山:西昌:美姑:昭觉:金阳:甘洛:布拖:雷波:普格:宁南:喜德:会东:越西:会理:盐源:德昌:冕宁:木里,广元:旺苍:青川:剑阁:苍溪,阿坝:九寨沟:汶川:马尔康:红原:理县:若尔盖:小金:黑水:金川:松潘:壤塘:阿坝县:茂县|"
    //+ "西藏,山南:乃东:扎囊:贡嘎:桑日:琼结:曲松:措美:洛扎:加查:隆子:错那:浪卡子,那曲:嘉黎:比如:聂荣:安多:申扎:索县:班戈:巴青:尼玛:那曲县,林芝:工布江达:米林:墨脱:波密:察隅:朗县:林芝县,昌都:昌都县:江达:贡觉:类乌齐:丁青:察雅:八宿:左贡:芒康:洛隆:边坝,阿里:普兰:札达:噶尔:日土:革吉:改则:措勤,日喀则:南木林:江孜:定日:萨迦:拉孜:昂仁:谢通门:白朗:仁布:康马:定结:仲巴:亚东:吉隆:聂拉木:萨嘎:岗巴,拉萨:林周:当雄:尼木:曲水:堆龙德庆:达孜:墨竹工卡|"
    //+ "云南,文山:砚山:西畴:麻栗坡:马关:丘北:广南:富宁:文山县,玉溪:江川:澄江:通海:华宁:易门:峨山:新平:元江,保山:施甸:腾冲:龙陵:昌宁,普洱:西盟:思茅:墨江:景东:景谷:镇沅:江城:孟连:澜沧:普洱,楚雄:双柏:牟定:南华:姚安:大姚:永仁:元谋:武定:禄丰:楚雄,红河:开远:个旧:蒙自:屏边:建水:石屏:弥勒:泸西:元阳:红河县:金平:绿春:河口,临沧:凤庆:沧源:云县:永德:镇康:双江:耿马,迪庆:香格里拉:德钦:维西傈,曲靖:宣威:马龙:陆良:师宗:罗平:富源:会泽:沾益,大理:漾濞:祥云:宾川:弥渡:南涧:巍山:永平:云龙:洱源:剑川:鹤庆,德宏:瑞丽:潞西:梁河:盈江:陇川,怒江:泸水:福贡:贡山:兰坪:怒江,丽江:玉龙:永胜:华坪:宁蒗,昭通:鲁甸:巧家:盐津:大关:永善:绥江:镇雄:彝良:威信:水富,昆明:安宁:呈贡:晋宁:富民:宜良:石林彝族:嵩明:禄劝彝族苗族:寻甸回族彝族:昆明,西双版纳:景洪:勐海:勐腊|"
    //+ "甘肃,甘南:合作:临潭:卓尼:舟曲:迭部:玛曲:碌曲:夏河,嘉峪关,临夏:临夏县:广河:康乐:永靖:和政:东乡族自治县:积石山保安族东乡族撒拉族自治县,酒泉:玉门:敦煌:瓜州:金塔:阿克塞:肃北,金昌:永昌,张掖:民乐:山丹:临泽:高台:肃南,天水:甘谷:武山:清水:秦安:张家川,白银:靖远:景泰:会宁,庆阳:庆城:镇原:合水:华池:环县:宁县:正宁:西峰,陇南:武都:陇南:成县:礼县:康县:文县:两当:徽县:宕昌:西和,平凉:灵台:静宁:崇信:华亭:泾川:庄浪,兰州:皋兰:永登:榆中,定西:漳县:岷县:渭源:陇西:通渭:临洮,武威:古浪:民勤:天祝|"
    //+ "宁夏,银川:灵武:永宁:贺兰,中卫:中宁:海原,固原:西吉:隆德:泾源:彭阳,吴忠:青铜峡:盐池:同心,石嘴山:平罗:惠农|"
    //+ "青海,海西:格尔木:德令哈:乌兰:天峻:都兰,海北:海晏:祁连:刚察:门源,果洛:玛沁:班玛:甘德:达日:久治:玛多,西宁:湟中:湟源:大通,海东:平安:乐都:民和:互助:化隆:循化,黄南:同仁:泽库:河南,海南:贵德:共和:同德:兴海:贵南,玉树:杂多:玉树县:称多:治多:囊谦:曲麻莱|"
    //+ "陕西,延安:安塞:洛川:子长:黄陵:延川:富县:延长:甘泉:宜川:志丹:黄龙:吴起,榆林:定边:府谷:榆林:清涧:神木:佳县:子洲:靖边:横山:米脂:吴堡:绥德,宝鸡:凤翔:岐山:眉县:宝鸡:太白:麟游:扶风:千阳:凤县:陇县,渭南:韩城:华阴:潼关:白水:澄城:华县:合阳:富平:大荔:蒲城,西安:高陵:蓝田:周至:户县,铜川:宜君,咸阳:兴平:礼泉:泾阳:三原:彬县:旬邑:长武:乾县:武功:淳化:永寿,安康:紫阳:岚皋:旬阳:平利:石泉:宁陕:白河:汉阴:镇坪,商洛:商州:镇安:山阳:洛南:商南:丹凤:柞水,汉中:佛坪:汉中:留坝:镇巴:城固:南郑:洋县:宁强:勉县:西乡:略阳|"
    //+ "新疆,克孜勒苏柯尔克孜:阿图什:阿克陶:阿合奇:乌恰,塔城:乌苏:额敏:沙湾:托里:裕民:和布克赛尔,阿克苏:温宿:库车:沙雅:新和:拜城:乌什:阿瓦提:柯坪,石河子,五家渠,喀什:疏附:疏勒:英吉沙:泽普:莎车:叶城:麦盖提:岳普湖:伽师:巴楚:塔什库尔干塔吉克,巴音郭楞:库尔勒:轮台:尉犁:若羌:且末:焉耆:和静:和硕:博湖,昌吉:阜康:米泉:呼图壁:玛纳斯:奇台:吉木萨尔:木垒哈萨克,伊犁哈萨克:伊宁:奎屯:伊宁县:察布查尔锡伯:霍城:巩留:新源:昭苏:特克斯:尼勒克,吐鲁番:鄯善:托克逊,阿拉尔,哈密:巴里坤哈萨克:伊吾,乌鲁木齐:乌鲁木齐县,克拉玛依,和田:和田县:墨玉:皮山:洛浦:策勒:于田:民丰,图木舒克,博尔塔拉:博乐:精河:温泉,阿勒泰:布尔津:富蕴:福海:哈巴河:青河:吉木乃|"
    //+ "香港,香港:香港岛:九龙:新界|"
    //+ "澳门,澳门:澳门半岛:澳门离岛"
    ,
    init: function () {
        this.bindSelect();
    },
    bindSelect: function (obj) {
        var o, t, a = (obj || document).getElementsByTagName('select');
        for (var i = 0; i < a.length; i++) {
            o = a[i];
            if (t = o.getAttribute('bind')) {
                if (!o.isbind) {
                    o.isbind = 1;
                    this.bind(o, t);
                }
            }
        }
    },
    bind: function (o, t) {
        var c, a = this[t].split(',');
        for (var i = 0; i < a.length; i++) {
            c = a[i].split(':')[0];
            o[o.length] = new Option(c, c);
        }
    },
    bindCity: function (prov, city, area, autohide) {
        var _ = this, b, c, d, e, u, v, r, s, a = _.citys, h = _.hash;
        if (!a) {
            a = [];
            r = _.city.split('|');
            for (var i = 0; i < r.length; i++) {
                c = r[i].split(',');
                s = c[0];
                u = { s: s, a: [] };
                h[s] = u;
                a.push(u);
                for (var j = 1; j < c.length; j++) {
                    d = c[j].split(':');
                    s = d[0];
                    v = { s: s, a: [] };
                    h[[u.s, s].join('_')] = v;
                    u.a.push(v);
                    for (var k = 1; k < d.length; k++) {
                        s = d[k];
                        v.a.push({ s: s });
                    }
                }
            }
            _.citys = a;
        }
        prov.len = prov.length;
        city.len = city.length;
        area.len = area.length;
        _.fillData(prov, a);
        prov.onchange = function () {
            var s = (this[this.selectedIndex] || {}).value;
            var a = s ? _.hash[s].a : [];
            _.fillData(city, a);
            if (city.onchange) city.onchange();
        }
        prov.onchange();
        city.onchange = function () {
            var s = (this[this.selectedIndex] || {}).value;
            var a = s ? _.hash[[prov.value, s].join('_')].a : [];
            _.fillData(area, a);
            if (autohide) {
                setTimeout(function () {
                    city.style.display = prov.value ? '' : 'none';
                    area.style.display = city.value ? '' : 'none';
                })
            }
        }
        city.onchange();
    },
    fillData: function (o, a) {
        o.length = o.len || 0;
        for (var i = 0; i < a.length; i++) {
            var c = a[i].s;
            o[o.length] = new Option(c, c);
        }
    }
}